{
  "color-picker": {
    "title": "온라인 컬러 피커: 색상 코드를 확인하고 변환하는 무료 도구",
    "description": "온라인 컬러 피커는 사용자가 색상 코드를 확인하고 변환할 수 있는 무료 도구입니다. RGB, HEX, HSL, HSV, CMYK 등 다양한 색상 코드를 지원하며, 색상 선택기를 통해 쉽게 색상을 선택할 수 있습니다.",
    "url": "/ko/design/color-picker",
    "sections": [
      {
        "title": "색상 코드 변환",
        "content": "사용자는 색상 선택기를 통해 원하는 색상을 선택하고, 선택된 색상의 RGB, HEX, HSL, HSV, CMYK 등 다양한 색상 코드를 확인할 수 있습니다. 또한, 사용자가 직접 색상 코드를 입력하여 변환할 수도 있습니다. 색상 코드 변환은 웹 디자인, 그래픽 디자인, 프로그래밍 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "색상 선택기 활용",
        "content": "색상 선택기를 사용하면 색상을 직접 선택하거나 색상 코드를 입력하여 원하는 색상을 확인할 수 있습니다. 색상 선택기는 색상을 시각적으로 확인하고, 다양한 색상 코드를 변환하는 데 유용한 도구입니다."
      },
      {
        "title": "색상 코드의 활용 예",
        "content": [
          "웹 디자인 및 개발에서 색상을 지정할 때",
          "그래픽 디자인에서 색상을 조합하거나 변환할 때",
          "프로그래밍에서 색상 코드를 사용할 때",
          "인쇄물 디자인에서 색상을 지정할 때"
        ]
      }
    ]
  },
  "color-code-convert": {
    "title": "효율적인 색상 변환기: RGB, HEX, HSL 간 색깔 코드 변환 사이트",
    "description": "RGB, HEX, HSL 형식 간 쉽게 색상 코드를 변환할 수 있는 효율적인 색상 변환기로, 디자인 및 개발 작업을 더욱 정밀하고 간편하게 처리하세요.",
    "url": "/ko/convert/color-code-convert",
    "sections": [
      {
        "title": "HEX 형식",
        "content": "웹 디자인 및 디지털 미디어에서 필수적인 HEX 코드는 '#'로 시작하고 그 뒤에 숫자(0-9)와 글자(A-F)로 이루어진 6개의 문자를 포함하는 16진수 형식으로 표현됩니다. 이 부분들은 빨간색, 초록색, 파란색의 강도를 정의합니다. 이 형식은 사용하기 쉬울 뿐만 아니라 현대의 브라우저와 그래픽 디자인 도구에서 널리 허용되어 디지털 프로젝트의 일관성을 보장합니다."
      },
      {
        "title": "RGB 형식",
        "content": "RGB는 Red, Green, Blue의 약자로, 이 세 가지 기본 색상의 강도를 통해 색상을 표현합니다. 각 구성 요소는 0에서 255까지의 범위를 가집니다. 이 형식은 스캐너, 카메라, 디스플레이와 같은 장치에서 사용되는 디지털 색상 표현의 기반이며, 높은 생동감과 넓은 색상 스펙트럼이 요구되는 애플리케이션에서 특히 선호됩니다. 이는 정확한 색상 혼합과 시각 효과를 가능하게 합니다."
      },
      {
        "title": "HSL 형식",
        "content": "HSL은 Hue, Saturation, Lightness를 나타내며, 색상 조작을 보다 직관적으로 할 수 있는 방법을 제공합니다. Hue는 색상 휠을 반영하여 0도에서 360도까지 측정되고, Saturation은 회색에서 벗어남을 나타내는 백분율로 표시되며, Lightness는 검은색(0%)에서 흰색(100%)까지의 색조를 나타냅니다. 이 형식은 특정 색상 팔레트를 생성하거나 테마의 미묘한 조정을 목표로 하는 디자이너들에게 특히 유용합니다."
      },
      {
        "title": "변환기 사용법",
        "content": "색상 변환기는 사용하기 쉽게 디자인되었습니다. 사용자는 입력 형식을 선택하고, 색상 코드를 입력한 다음, 원하는 출력 형식을 선택하고 제출합니다. 도구는 입력을 효율적으로 처리하여 선택된 형식으로 변환하고, 새 코드와 시각적 표현을 모두 표시합니다. 이 기능은 빠르고 정확한 색상 변환을 가능하게 하여 디자인 및 개발 과정을 간소화하는 데 중요합니다."
      },
      {
        "title": "일반적인 사용 사례",
        "content": "색상 변환기는 웹 디자인, 그래픽 디자인, 인쇄 생산 등 다양한 분야에서 매우 유용합니다. 이러한 분야에서는 색상 형식의 신속한 적용, 미디어 간 색상의 일관성 유지, 품질 관리를 위한 정확한 색상 표현이 필수적입니다."
      },
      {
        "title": "각 형식의 장점",
        "content": "각 색상 형식은 고유의 장점을 제공합니다. HEX는 간단함과 널리 사용됨으로써 웹 디자인에 이상적입니다. RGB는 미디어의 생동감을 강화하고 디지털 디스플레이 색상을 직접 제어하는 데 필수적입니다. HSL은 디자인 유연성에서 뛰어나 테마 조정 및 색상 속성(색조, 채도, 밝기)의 미세 조정에 완벽합니다."
      }
    ]
  },
  "image-compress": {
    "title": "온라인 이미지 압축기: 이미지 파일 크기를 줄이는 무료 도구",
    "description": "온라인 이미지 압축기는 사용자가 이미지 파일의 크기를 줄이고 웹 페이지의 로딩 속도를 향상시킬 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고 압축된 이미지를 다운로드할 수 있습니다.",
    "url": "/ko/design/image-compress",
    "sections": [
      {
        "title": "이미지 파일 압축",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 압축기를 통해 이미지 파일의 크기를 줄일 수 있습니다. 이미지 파일 압축은 웹 페이지의 로딩 속도를 향상시키고, 서버 공간을 절약하는 데 유용합니다."
      },
      {
        "title": "이미지 포맷 변환",
        "content": "사용자는 이미지 파일을 다른 포맷으로 변환하거나, 이미지 품질을 조절하여 원하는 크기로 압축할 수 있습니다. 이미지 포맷 변환은 웹 디자인, 그래픽 디자인, 프로그래밍 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 압축의 활용 예",
        "content": [
          "웹 페이지의 이미지 파일을 압축하여 로딩 속도를 향상시킬 때",
          "이미지 파일의 용량을 줄여 서버 공간을 절약할 때",
          "이미지 포맷을 변환하여 웹 페이지에 적합한 형식으로 사용할 때",
          "이미지 품질을 조절하여 원하는 크기로 압축할 때"
        ]
      }
    ]
  },
  "image-crop": {
    "title": "온라인 이미지 크롭퍼: 이미지를 잘라내고 크기를 조절하는 무료 도구",
    "description": "온라인 이미지 크롭퍼는 사용자가 이미지를 잘라내고 크기를 조절할 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 원하는 부분을 선택하여 이미지를 크롭할 수 있습니다.",
    "url": "/ko/design/image-crop",
    "sections": [
      {
        "title": "이미지 크롭",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 크롭퍼를 통해 이미지를 잘라내어 원하는 부분을 선택할 수 있습니다. 이미지 크롭은 이미지의 크기를 조절하거나 원하는 부분을 강조하는 데 유용합니다."
      },
      {
        "title": "이미지 크기 조절",
        "content": "사용자는 이미지를 크롭하거나 크기를 조절하여 원하는 형태로 이미지를 가공할 수 있습니다. 이미지 크롭은 웹 디자인, 그래픽 디자인, 사진 편집 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 크롭의 활용 예",
        "content": [
          "웹 페이지에 적합한 이미지 크기로 조절할 때",
          "이미지의 일부분을 강조하거나 잘라낼 때",
          "이미지를 원하는 형태로 가공할 때",
          "사진을 편집하여 원하는 부분을 강조할 때"
        ]
      }
    ]
  },
  "image-flip": {
    "title": "온라인 이미지 뒤집기: 이미지를 수평 또는 수직으로 뒤집는 무료 도구",
    "description": "온라인 이미지 뒤집기는 사용자가 이미지를 수평 또는 수직으로 뒤집을 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 원하는 방향으로 이미지를 뒤집을 수 있습니다.",
    "url": "/ko/design/image-flip",
    "sections": [
      {
        "title": "이미지 뒤집기",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 뒤집기를 통해 이미지를 수평 또는 수직으로 뒤집을 수 있습니다. 이미지 뒤집기는 이미지를 반전시켜 다양한 효과를 줄 때 유용합니다."
      },
      {
        "title": "이미지 회전",
        "content": "사용자는 이미지를 회전하거나 뒤집어서 원하는 방향으로 이미지를 가공할 수 있습니다. 이미지 뒤집기는 웹 디자인, 그래픽 디자인, 사진 편집 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 뒤집기의 활용 예",
        "content": [
          "사진을 반전시켜 다양한 효과를 줄 때",
          "이미지를 원하는 방향으로 회전할 때",
          "웹 페이지에 적합한 이미지 방향으로 가공할 때",
          "사진을 편집하여 원하는 효과를 줄 때"
        ]
      }
    ]
  },
  "image-resize": {
    "title": "온라인 이미지 리사이즈: 이미지 크기를 조절하는 무료 도구",
    "description": "온라인 이미지 리사이즈는 사용자가 이미지 크기를 조절할 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 원하는 크기로 이미지를 리사이즈할 수 있습니다.",
    "url": "/ko/design/image-resize",
    "sections": [
      {
        "title": "이미지 리사이즈",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 리사이즈를 통해 이미지의 크기를 조절할 수 있습니다. 이미지 리사이즈는 이미지를 웹 페이지에 적합한 크기로 가공하거나, 인쇄용 이미지로 변환하는 데 유용합니다."
      },
      {
        "title": "이미지 크기 조절",
        "content": "사용자는 이미지를 원하는 크기로 조절하거나, 비율을 유지하면서 이미지를 리사이즈할 수 있습니다. 이미지 리사이즈는 웹 디자인, 그래픽 디자인, 사진 편집 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 리사이즈의 활용 예",
        "content": [
          "웹 페이지에 적합한 이미지 크기로 조절할 때",
          "인쇄용 이미지로 변환할 때",
          "이미지의 비율을 유지하면서 크기를 조절할 때",
          "사진을 편집하여 원하는 크기로 가공할 때"
        ]
      }
    ]
  },
  "watermark": {
    "title": "온라인 워터마크 추가: 이미지에 로고나 텍스트를 삽입하는 무료 도구",
    "description": "온라인 워터마크 추가는 사용자가 이미지에 로고나 텍스트를 삽입할 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 워터마크를 추가하여 이미지를 보호하거나 식별할 수 있습니다.",
    "url": "/ko/design/watermark",
    "sections": [
      {
        "title": "워터마크 추가",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 워터마크 추가를 통해 이미지에 로고나 텍스트를 삽입할 수 있습니다. 워터마크 추가는 이미지를 보호하거나 식별하는 데 유용합니다."
      },
      {
        "title": "로고 삽입",
        "content": "사용자는 로고 이미지를 업로드하거나 텍스트를 입력하여 이미지에 워터마크를 삽입할 수 있습니다. 워터마크 추가는 웹 디자인, 그래픽 디자인, 사진 보호 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "워터마크 추가의 활용 예",
        "content": [
          "이미지를 보호하기 위해 로고를 삽입할 때",
          "이미지를 식별하기 위해 텍스트를 삽입할 때",
          "웹 페이지에 이미지를 게시할 때 워터마크를 추가할 때",
          "사진을 보호하거나 저작권을 주장할 때"
        ]
      }
    ]
  }
}
