{
  "color-picker": {
    "title": "온라인 컬러 피커: 색상 코드를 확인하고 변환하는 무료 도구",
    "description": "온라인 컬러 피커는 사용자가 색상 코드를 확인하고 변환할 수 있는 무료 도구입니다. RGB, HEX, HSL, HSV, CMYK 등 다양한 색상 코드를 지원하며, 색상 선택기를 통해 쉽게 색상을 선택할 수 있습니다.",
    "url": "/ko/image/color-picker",
    "sections": [
      {
        "title": "색상 코드 변환",
        "content": "사용자는 색상 선택기를 통해 원하는 색상을 선택하고, 선택된 색상의 RGB, HEX, HSL, HSV, CMYK 등 다양한 색상 코드를 확인할 수 있습니다. 또한, 사용자가 직접 색상 코드를 입력하여 변환할 수도 있습니다. 색상 코드 변환은 웹 디자인, 그래픽 디자인, 프로그래밍 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "색상 선택기 활용",
        "content": "색상 선택기를 사용하면 색상을 직접 선택하거나 색상 코드를 입력하여 원하는 색상을 확인할 수 있습니다. 색상 선택기는 색상을 시각적으로 확인하고, 다양한 색상 코드를 변환하는 데 유용한 도구입니다."
      },
      {
        "title": "색상 코드의 활용 예",
        "content": [
          "웹 디자인 및 개발에서 색상을 지정할 때",
          "그래픽 디자인에서 색상을 조합하거나 변환할 때",
          "프로그래밍에서 색상 코드를 사용할 때",
          "인쇄물 디자인에서 색상을 지정할 때"
        ]
      }
    ]
  },
  "compress": {
    "title": "온라인 이미지 압축기: 이미지 파일 크기를 줄이는 무료 도구",
    "description": "온라인 이미지 압축기는 사용자가 이미지 파일의 크기를 줄이고 웹 페이지의 로딩 속도를 향상시킬 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고 압축된 이미지를 다운로드할 수 있습니다.",
    "url": "/ko/image/compress",
    "sections": [
      {
        "title": "이미지 파일 압축",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 압축기를 통해 이미지 파일의 크기를 줄일 수 있습니다. 이미지 파일 압축은 웹 페이지의 로딩 속도를 향상시키고, 서버 공간을 절약하는 데 유용합니다."
      },
      {
        "title": "이미지 포맷 변환",
        "content": "사용자는 이미지 파일을 다른 포맷으로 변환하거나, 이미지 품질을 조절하여 원하는 크기로 압축할 수 있습니다. 이미지 포맷 변환은 웹 디자인, 그래픽 디자인, 프로그래밍 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 압축의 활용 예",
        "content": [
          "웹 페이지의 이미지 파일을 압축하여 로딩 속도를 향상시킬 때",
          "이미지 파일의 용량을 줄여 서버 공간을 절약할 때",
          "이미지 포맷을 변환하여 웹 페이지에 적합한 형식으로 사용할 때",
          "이미지 품질을 조절하여 원하는 크기로 압축할 때"
        ]
      }
    ]
  },
  "crop": {
    "title": "온라인 이미지 크롭퍼: 이미지를 잘라내고 크기를 조절하는 무료 도구",
    "description": "온라인 이미지 크롭퍼는 사용자가 이미지를 잘라내고 크기를 조절할 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 원하는 부분을 선택하여 이미지를 크롭할 수 있습니다.",
    "url": "/ko/image/crop",
    "sections": [
      {
        "title": "이미지 크롭",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 크롭퍼를 통해 이미지를 잘라내어 원하는 부분을 선택할 수 있습니다. 이미지 크롭은 이미지의 크기를 조절하거나 원하는 부분을 강조하는 데 유용합니다."
      },
      {
        "title": "이미지 크기 조절",
        "content": "사용자는 이미지를 크롭하거나 크기를 조절하여 원하는 형태로 이미지를 가공할 수 있습니다. 이미지 크롭은 웹 디자인, 그래픽 디자인, 사진 편집 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 크롭의 활용 예",
        "content": [
          "웹 페이지에 적합한 이미지 크기로 조절할 때",
          "이미지의 일부분을 강조하거나 잘라낼 때",
          "이미지를 원하는 형태로 가공할 때",
          "사진을 편집하여 원하는 부분을 강조할 때"
        ]
      }
    ]
  },
  "flip": {
    "title": "온라인 이미지 뒤집기: 이미지를 수평 또는 수직으로 뒤집는 무료 도구",
    "description": "온라인 이미지 뒤집기는 사용자가 이미지를 수평 또는 수직으로 뒤집을 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 원하는 방향으로 이미지를 뒤집을 수 있습니다.",
    "url": "/ko/image/flip",
    "sections": [
      {
        "title": "이미지 뒤집기",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 뒤집기를 통해 이미지를 수평 또는 수직으로 뒤집을 수 있습니다. 이미지 뒤집기는 이미지를 반전시켜 다양한 효과를 줄 때 유용합니다."
      },
      {
        "title": "이미지 회전",
        "content": "사용자는 이미지를 회전하거나 뒤집어서 원하는 방향으로 이미지를 가공할 수 있습니다. 이미지 뒤집기는 웹 디자인, 그래픽 디자인, 사진 편집 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 뒤집기의 활용 예",
        "content": [
          "사진을 반전시켜 다양한 효과를 줄 때",
          "이미지를 원하는 방향으로 회전할 때",
          "웹 페이지에 적합한 이미지 방향으로 가공할 때",
          "사진을 편집하여 원하는 효과를 줄 때"
        ]
      }
    ]
  },
  "resize": {
    "title": "온라인 이미지 리사이즈: 이미지 크기를 조절하는 무료 도구",
    "description": "온라인 이미지 리사이즈는 사용자가 이미지 크기를 조절할 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 원하는 크기로 이미지를 리사이즈할 수 있습니다.",
    "url": "/ko/image/resize",
    "sections": [
      {
        "title": "이미지 리사이즈",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 이미지 리사이즈를 통해 이미지의 크기를 조절할 수 있습니다. 이미지 리사이즈는 이미지를 웹 페이지에 적합한 크기로 가공하거나, 인쇄용 이미지로 변환하는 데 유용합니다."
      },
      {
        "title": "이미지 크기 조절",
        "content": "사용자는 이미지를 원하는 크기로 조절하거나, 비율을 유지하면서 이미지를 리사이즈할 수 있습니다. 이미지 리사이즈는 웹 디자인, 그래픽 디자인, 사진 편집 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "이미지 리사이즈의 활용 예",
        "content": [
          "웹 페이지에 적합한 이미지 크기로 조절할 때",
          "인쇄용 이미지로 변환할 때",
          "이미지의 비율을 유지하면서 크기를 조절할 때",
          "사진을 편집하여 원하는 크기로 가공할 때"
        ]
      }
    ]
  },
  "watermark": {
    "title": "온라인 워터마크 추가: 이미지에 로고나 텍스트를 삽입하는 무료 도구",
    "description": "온라인 워터마크 추가는 사용자가 이미지에 로고나 텍스트를 삽입할 수 있는 무료 도구입니다. 사용자는 이미지 파일을 업로드하고, 워터마크를 추가하여 이미지를 보호하거나 식별할 수 있습니다.",
    "url": "/ko/image/watermark",
    "sections": [
      {
        "title": "워터마크 추가",
        "content": "사용자는 이미지 파일을 업로드하고, 온라인 워터마크 추가를 통해 이미지에 로고나 텍스트를 삽입할 수 있습니다. 워터마크 추가는 이미지를 보호하거나 식별하는 데 유용합니다."
      },
      {
        "title": "로고 삽입",
        "content": "사용자는 로고 이미지를 업로드하거나 텍스트를 입력하여 이미지에 워터마크를 삽입할 수 있습니다. 워터마크 추가는 웹 디자인, 그래픽 디자인, 사진 보호 등 다양한 분야에서 활용됩니다."
      },
      {
        "title": "워터마크 추가의 활용 예",
        "content": [
          "이미지를 보호하기 위해 로고를 삽입할 때",
          "이미지를 식별하기 위해 텍스트를 삽입할 때",
          "웹 페이지에 이미지를 게시할 때 워터마크를 추가할 때",
          "사진을 보호하거나 저작권을 주장할 때"
        ]
      }
    ]
  }
}
