{
  "csv_editor": {
    "title": "CSV 파일 편집기 : 온라인 CSV 편집기 - 온툴모",
    "description": "CSV 파일을 온라인에서 쉽게 편집하고 저장할 수 있는 온라인 CSV 편집기입니다. CSV 파일을 업로드하거나 직접 입력하여 데이터를 편집하고, 다양한 형식으로 내보내기할 수 있습니다.",
    "url": "/ko/spreadsheet/csv_editor",
    "sections": [
      {
        "title": "CSV 파일 편집기 사용법",
        "content": [
          "CSV 파일 업로드 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 CSV 파일을 업로드합니다. 업로드된 파일은 편집기에 표시되며, 데이터를 편집할 수 있습니다.",
          "직접 입력 : '직접 입력' 탭을 선택하여 텍스트 상자에 데이터를 직접 입력할 수 있습니다. 각 열은 쉼표(,)로 구분되며, 각 행은 줄 바꿈으로 구분됩니다.",
          "데이터 편집 : 테이블에서 데이터를 클릭하여 수정할 수 있습니다. 새로운 행 또는 열을 추가하거나 삭제할 수도 있습니다.",
          "데이터 정렬 : 열 제목을 클릭하여 데이터를 오름차순 또는 내림차순으로 정렬할 수 있습니다.",
          "데이터 내보내기 : '내보내기' 버튼을 클릭하여 편집한 데이터를 CSV, Excel, JSON 등 다양한 형식으로 내보낼 수 있습니다."
        ]
      },
      {
        "title": "CSV 파일 형식",
        "content": [
          "CSV(Comma-Separated Values) 파일은 데이터를 쉼표 (,)로 구분하여 저장하는 파일 형식입니다. 각 행은 데이터 레코드를 나타내며, 각 열은 데이터 필드를 나타냅니다. CSV 파일은 텍스트 파일로 저장되며, 일반적으로 스프레드시트 프로그램에서 사용됩니다.",
          "CSV 파일은 데이터를 구조화하고 저장하는 데 유용하며, 데이터베이스, 웹사이트, 소프트웨어 등에서 데이터를 교환하거나 백업하는 데 자주 사용됩니다. CSV 파일은 텍스트 편집기로 열어도 데이터를 확인할 수 있으며, 스프레드시트 프로그램에서 열면 데이터를 편집하고 시각화할 수 있습니다."
        ]
      },
      {
        "title": "CSV 파일 사용 사례",
        "content": [
          "데이터 이관 : 데이터베이스나 스프레드시트에서 데이터를 CSV 파일로 내보내거나, CSV 파일에서 데이터를 가져와 데이터베이스나 스프레드시트에 저장할 때 사용됩니다.",
          "데이터 백업 : 중요한 데이터를 백업할 때, CSV 파일로 저장하여 나중에 필요할 때 데이터를 복원할 수 있습니다.",
          "데이터 분석 : 데이터를 CSV 파일로 저장하고, 데이터 분석 도구를 사용하여 데이터를 시각화하거나 분석할 수 있습니다.",
          "데이터 공유 : 다른 사용자와 데이터를 공유할 때, CSV 파일을 첨부하여 데이터를 쉽게 전송하거나 공유할 수 있습니다."
        ]
      },
      {
        "title": "참고할 사이트",
        "content": [
          "CSV 파일 형식 - CSV 파일 형식에 대한 자세한 정보를 제공하는 위키피디아 페이지입니다. (https://ko.wikipedia.org/wiki/CSV_(%ED%8C%8C%EC%9D%BC_%ED%98%95%EC%8B%9D))",
          "CSV 파일 편집기 - 온라인에서 CSV 파일을 편집하고 저장할 수 있는 무료 툴입니다. (https://www.ontoolmo.com/ko/spreadsheet/csv-editor)"
        ]
      }
    ]
  },
  "json_editor": {
    "title": "JSON 파일 편집기 : 온라인 JSON 편집기 - 온툴모",
    "description": "JSON 파일을 온라인에서 쉽게 편집하고 저장할 수 있는 온라인 JSON 편집기입니다. JSON 파일을 업로드하거나 직접 입력하여 데이터를 편집하고, 다양한 형식으로 내보내기할 수 있습니다.",
    "url": "/ko/spreadsheet/json_editor",
    "sections": [
      {
        "title": "JSON 파일 편집기 사용법",
        "content": [
          "JSON 파일 업로드 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 JSON 파일을 업로드합니다. 업로드된 파일은 편집기에 표시되며, 데이터를 편집할 수 있습니다.",
          "직접 입력 : '직접 입력' 탭을 선택하여 텍스트 상자에 데이터를 직접 입력할 수 있습니다. JSON 형식에 맞게 데이터를 입력해야 합니다.",
          "데이터 편집 : JSON 데이터를 편집할 수 있습니다. 데이터를 클릭하여 수정하거나, 새로운 데이터를 추가하거나 삭제할 수 있습니다.",
          "데이터 정렬 : JSON 데이터를 키(프로퍼티)로 정렬할 수 있습니다. 키를 클릭하여 오름차순 또는 내림차순으로 정렬할 수 있습니다.",
          "데이터 내보내기 : '내보내기' 버튼을 클릭하여 편집한 데이터를 JSON, XML, YAML 등 다양한 형식으로 내보낼 수 있습니다."
        ]
      },
      {
        "title": "JSON 파일 형식",
        "content": [
          "JSON(JavaScript Object Notation) 파일은 데이터를 텍스트 형식으로 표현하는 파일 형식입니다. JSON 파일은 키-값 쌍으로 구성되며, 중괄호({})로 데이터를 묶어 표현합니다.",
          "JSON 파일은 데이터를 계층적으로 구조화하고 저장하는 데 유용하며, 웹사이트, 소프트웨어, API 등에서 데이터를 교환하거나 저장하는 데 자주 사용됩니다. JSON 파일은 텍스트 편집기로 열어도 데이터를 확인할 수 있으며, 프로그래밍 언어에서 JSON 데이터를 파싱하여 사용할 수 있습니다."
        ]
      },
      {
        "title": "JSON 파일 사용 사례",
        "content": [
          "데이터 교환 : 웹사이트, 소프트웨어, API 등에서 데이터를 교환할 때, JSON 파일로 데이터를 전송하거나 수신할 수 있습니다.",
          "데이터 저장 : 계층적으로 구조화된 데이터를 저장할 때, JSON 파일로 데이터를 저장하고 나중에 사용할 수 있습니다.",
          "데이터 파싱 : 프로그래밍 언어에서 JSON 데이터를 파싱하여 사용할 수 있습니다. JSON 파일을 읽어와 데이터를 처리하거나 시각화할 수 있습니다.",
          "데이터 설정 : 소프트웨어 설정 파일이나 구성 파일을 JSON 형식으로 저장하여 사용할 수 있습니다."
        ]
      },
      {
        "title": "참고할 사이트",
        "content": [
          "JSON 파일 형식 - JSON 파일 형식에 대한 자세한 정보를 제공하는 위키피디아 페이지입니다. (https://ko.wikipedia.org/wiki/JSON)",
          "JSON 파일 편집기 - 온라인에서 JSON 파일을 편집하고 저장할 수 있는 무료 툴입니다. (https://www.ontoolmo.com/ko/spreadsheet/json-editor)"
        ]
      }
    ]
  },
  "excel_editor": {
    "title": "엑셀 파일 편집기 : 온라인 엑셀 편집기 - 온툴모",
    "description": "엑셀 파일을 온라인에서 쉽게 편집하고 저장할 수 있는 온라인 엑셀 편집기입니다. 엑셀 파일을 업로드하거나 직접 입력하여 데이터를 편집하고, 다양한 형식으로 내보내기할 수 있습니다.",
    "url": "/ko/spreadsheet/excel_editor",
    "sections": [
      {
        "title": "엑셀 파일 편집기 사용법",
        "content": [
          "엑셀 파일 업로드 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 엑셀 파일을 업로드합니다. 업로드된 파일은 편집기에 표시되며, 데이터를 편집할 수 있습니다.",
          "직접 입력 : '직접 입력' 탭을 선택하여 텍스트 상자에 데이터를 직접 입력할 수 있습니다. 각 열은 탭으로 구분되며, 각 행은 줄 바꿈으로 구분됩니다.",
          "데이터 편집 : 테이블에서 데이터를 클릭하여 수정할 수 있습니다. 새로운 행 또는 열을 추가하거나 삭제할 수도 있습니다.",
          "데이터 정렬 : 열 제목을 클릭하여 데이터를 오름차순 또는 내림차순으로 정렬할 수 있습니다.",
          "데이터 내보내기 : '내보내기' 버튼을 클릭하여 편집한 데이터를 엑셀, CSV, PDF 등 다양한 형식으로 내보낼 수 있습니다."
        ]
      },
      {
        "title": "엑셀 파일 형식",
        "content": [
          "엑셀 파일은 마이크로소프트 엑셀 소프트웨어에서 사용되는 스프레드시트 파일 형식입니다. 엑셀 파일은 행과 열로 구성된 테이블 형식의 데이터를 저장하며, 각 셀에 데이터가 저장됩니다.",
          "엑셀 파일은 데이터를 시각화하고 편집하는 데 유용하며, 계산, 차트, 그래프 등 다양한 기능을 제공합니다. 엑셀 파일은 마이크로소프트 엑셀 소프트웨어로 열거나, 온라인 엑셀 편집기로 열어서 데이터를 편집할 수 있습니다."
        ]
      },
      {
        "title": "엑셀 파일 사용 사례",
        "content": [
          "데이터 관리 : 엑셀 파일을 사용하여 데이터를 관리하고 편집할 수 있습니다. 데이터를 정렬, 필터링, 계산하여 효율적으로 관리할 수 있습니다.",
          "데이터 시각화 : 엑셀 파일을 사용하여 데이터를 차트, 그래프로 시각화할 수 있습니다. 데이터를 시각적으로 표현하여 분석하거나 보고서를 작성할 수 있습니다.",
          "데이터 공유 : 엑셀 파일을 다른 사용자와 공유하여 데이터를 협업하거나 공유할 수 있습니다. 엑셀 파일을 이메일로 전송하거나 클라우드에 업로드하여 공유할 수 있습니다.",
          "데이터 분석 : 엑셀 파일을 사용하여 데이터를 분석하고 통계를 계산할 수 있습니다. 데이터를 필터링, 정렬하여 원하는 결과를 얻을 수 있습니다."
        ]
      },
      {
        "title": "참고할 사이트",
        "content": [
          "엑셀 파일 형식 - 엑셀 파일 형식에 대한 자세한 정보를 제공하는 위키피디아 페이지입니다. (https://ko.wikipedia.org/wiki/Microsoft_Excel)",
          "엑셀 파일 편집기 - 온라인에서 엑셀 파일을 편집하고 저장할 수 있는 무료 툴입니다. (https://www.ontoolmo.com/ko/spreadsheet/excel-editor)"
        ]
      }
    ]
  },
  "csv_convert": {
    "title": "CSV 변환기 : 온라인 CSV 변환 툴 - 온툴모",
    "description": "다양한 형식의 파일을 CSV 파일로 변환할 수 있는 온라인 CSV 변환기입니다. 엑셀, JSON, XML, YAML 등 다양한 형식의 파일을 CSV 파일로 변환하고, CSV 파일을 엑셀, JSON, XML, YAML 등 다양한 형식으로 변환할 수 있습니다.",
    "url": "/ko/spreadsheet/csv_convert",
    "sections": [
      {
        "title": "CSV 변환기 사용법",
        "content": [
          "파일 변환 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 변환할 파일을 업로드합니다. 변환할 파일의 형식을 선택하고, 변환할 형식을 선택합니다.",
          "데이터 변환 : 선택한 파일을 변환하여 CSV 파일로 저장하거나, CSV 파일을 선택한 형식으로 변환하여 저장할 수 있습니다.",
          "파일 내보내기 : '내보내기' 버튼을 클릭하여 변환한 파일을 다운로드할 수 있습니다."
        ]
      },
      {
        "title": "CSV 변환 사용 사례",
        "content": [
          "엑셀 파일을 CSV 파일로 변환하여 데이터를 교환하거나 저장할 수 있습니다.",
          "JSON 파일을 CSV 파일로 변환하여 데이터를 분석하거나 시각화할 수 있습니다.",
          "XML 파일을 CSV 파일로 변환하여 데이터를 가공하거나 처리할 수 있습니다.",
          "YAML 파일을 CSV 파일로 변환하여 데이터를 다른 형식으로 변환할 수 있습니다."
        ]
      },
      {
        "title": "참고할 사이트",
        "content": [
          "CSV 파일 형식 - CSV 파일 형식에 대한 자세한 정보를 제공하는 위키피디아 페이지입니다. (https://ko.wikipedia.org/wiki/CSV (파일 형식))",
          "CSV 변환기 - 온라인에서 다양한 형식의 파일을 CSV 파일로 변환할 수 있는 무료 툴입니다. (https://www.ontoolmo.com/ko/spreadsheet/csv-convert)"
        ]
      }
    ]
  },
  "json_convert": {
    "title": "JSON 변환기 : 온라인 JSON 변환 툴 - 온툴모",
    "description": "다양한 형식의 파일을 JSON 파일로 변환할 수 있는 온라인 JSON 변환기입니다. 엑셀, CSV, XML, YAML 등 다양한 형식의 파일을 JSON 파일로 변환하고, JSON 파일을 엑셀, CSV, XML, YAML 등 다양한 형식으로 변환할 수 있습니다.",
    "url": "/ko/spreadsheet/json_convert",
    "sections": [
      {
        "title": "JSON 변환기 사용법",
        "content": [
          "파일 변환 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 변환할 파일을 업로드합니다. 변환할 파일의 형식을 선택하고, 변환할 형식을 선택합니다.",
          "데이터 변환 : 선택한 파일을 변환하여 JSON 파일로 저장하거나, JSON 파일을 선택한 형식으로 변환하여 저장할 수 있습니다.",
          "파일 내보내기 : '내보내기' 버튼을 클릭하여 변환한 파일을 다운로드할 수 있습니다."
        ]
      },
      {
        "title": "JSON 변환 사용 사례",
        "content": [
          "엑셀 파일을 JSON 파일로 변환하여 데이터를 교환하거나 저장할 수 있습니다.",
          "CSV 파일을 JSON 파일로 변환하여 데이터를 분석하거나 시각화할 수 있습니다.",
          "XML 파일을 JSON 파일로 변환하여 데이터를 가공하거나 처리할 수 있습니다.",
          "YAML 파일을 JSON 파일로 변환하여 데이터를 다른 형식으로 변환할 수 있습니다."
        ]
      },
      {
        "title": "참고할 사이트",
        "content": [
          "JSON 파일 형식 - JSON 파일 형식에 대한 자세한 정보를 제공하는 위키피디아 페이지입니다. (https://ko.wikipedia.org/wiki/JSON (파일 형식))",
          "JSON 변환기 - 온라인에서 다양한 형식의 파일을 JSON 파일로 변환할 수 있는 무료 툴입니다. (https://www.ontoolmo.com/ko/spreadsheet/json-convert)"
        ]
      }
    ]
  },
  "xml_editor": {
    "title": "XML 파일 편집기 : 온라인 XML 편집기 - 온툴모",
    "description": "XML 파일을 온라인에서 쉽게 편집하고 저장할 수 있는 온라인 XML 편집기입니다. XML 파일을 업로드하거나 직접 입력하여 데이터를 편집하고, 다양한 형식으로 내보내기할 수 있습니다.",
    "url": "/ko/spreadsheet/xml_editor",
    "sections": [
      {
        "title": "XML 파일 편집기 사용법",
        "content": [
          "XML 파일 업로드 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 XML 파일을 업로드합니다. 업로드된 파일은 편집기에 표시되며, 데이터를 편집할 수 있습니다.",
          "직접 입력 : '직접 입력' 탭을 선택하여 텍스트 상자에 데이터를 직접 입력할 수 있습니다. XML 형식에 맞게 데이터를 입력해야 합니다.",
          "데이터 편집 : XML 데이터를 편집할 수 있습니다. 데이터를 클릭하여 수정하거나, 새로운 데이터를 추가하거나 삭제할 수 있습니다.",
          "데이터 정렬 : XML 데이터를 요소(태그)로 정렬할 수 있습니다. 요소를 클릭하여 오름차순 또는 내림차순으로 정렬할 수 있습니다.",
          "데이터 내보내기 : '내보내기' 버튼을 클릭하여 편집한 데이터를 XML, JSON, YAML 등 다양한 형식으로 내보낼 수 있습니다."
        ]
      },
      {
        "title": "XML 파일 형식",
        "content": [
          "XML(Extensible Markup Language) 파일은 데이터를 텍스트 형식으로 표현하는 파일 형식입니다. XML 파일은 요소(element)와 속성(attribute)으로 구성되며, 각 요소는 태그(tag)로 묶어 표현합니다.",
          "XML 파일은 데이터를 계층적으로 구조화하고 저장하는 데 유용하며, 웹사이트, 소프트웨어, 문서 등에서 데이터를 교환하거나 저장하는 데 자주 사용됩니다. XML 파일은 텍스트 편집기로 열어도 데이터를 확인할 수 있으며, 프로그래밍 언어에서 XML 데이터를 파싱하여 사용할 수 있습니다."
        ]
      }
    ]
  },
  "excel_convert": {
    "title": "엑셀 변환기 : 온라인 엑셀 변환 툴 - 온툴모",
    "description": "다양한 형식의 파일을 엑셀 파일로 변환할 수 있는 온라인 엑셀 변환기입니다. CSV, JSON, XML, YAML 등 다양한 형식의 파일을 엑셀 파일로 변환하고, 엑셀 파일을 CSV, JSON, XML, YAML 등 다양한 형식으로 변환할 수 있습니다.",
    "url": "/ko/spreadsheet/excel_convert",
    "sections": [
      {
        "title": "엑셀 변환기 사용법",
        "content": [
          "파일 변환 : '파일 열기' 버튼을 클릭하여 로컬 컴퓨터에서 변환할 파일을 업로드합니다. 변환할 파일의 형식을 선택하고, 변환할 형식을 선택합니다.",
          "데이터 변환 : 선택한 파일을 변환하여 엑셀 파일로 저장하거나, 엑셀 파일을 선택한 형식으로 변환하여 저장할 수 있습니다.",
          "파일 내보내기 : '내보내기' 버튼을 클릭하여 변환한 파일을 다운로드할 수 있습니다."
        ]
      },
      {
        "title": "엑셀 변환 사용 사례",
        "content": [
          "CSV 파일을 엑셀 파일로 변환하여 데이터를 시각화하거나 편집할 수 있습니다.",
          "JSON 파일을 엑셀 파일로 변환하여 데이터를 분석하거나 보고서를 작성할 수 있습니다.",
          "XML 파일을 엑셀 파일로 변환하여 데이터를 가공하거나 처리할 수 있습니다.",
          "YAML 파일을 엑셀 파일로 변환하여 데이터를 다른 형식으로 변환할 수 있습니다."
        ]
      },
      {
        "title": "참고할 사이트",
        "content": [
          "엑셀 변환기 - 온라인에서 다양한 형식의 파일을 엑셀 파일로 변환할 수 있는 무료 툴입니다. (https://www.ontoolmo.com/ko/spreadsheet/excel-convert)"
        ]
      }
    ]
  }
}
