{
  "d-day": {
    "title": "디데이 D-Day 계산기: 중요한 날짜까지 남은 시간을 정확히 계산, 기념일 및 이벤트 준비 필수 도구",
    "description": "특별한 이벤트, 기념일, 프로젝트 마감일 등 중요한 날짜까지 얼마나 남았는지를 정확하게 알려주는 디데이 D-Day 계산기입니다. 사용하기 쉬운 인터페이스로, 계획 중인 모든 이벤트의 날짜를 쉽게 관리할 수 있습니다.",
    "url": "/ko/time/d-day",
    "sections": [
      {
        "title": "디데이 D-Day 계산기 사용법",
        "content": "디데이 D-Day 계산기를 사용하여 특정 날짜까지 남은 기간을 계산할 수 있습니다. 타겟 날짜를 입력하고, D-Day를 확인해보세요."
      },
      {
        "title": "디데이 D-Day 계산기의 중요성",
        "content": "디데이 D-Day 계산기는 중요한 일정이나 이벤트까지 남은 기간을 확인하는 데 도움을 줍니다. D-Day를 통해 남은 기간을 시각적으로 확인하고, 계획을 세우세요."
      }
    ]
  },
  "pomodoro": {
    "title": "포모도로 타이머: 집중력을 높이고 생산성을 높이는 최고의 방법",
    "description": "포모도로 타이머는 집중력을 높이고 생산성을 높이는 데 도움을 주는 최고의 방법입니다. 포모도로 기법을 사용하여 일정 시간 동안 집중하고, 짧은 휴식을 취하며, 일을 반복하세요.",
    "url": "/ko/time/pomodoro",
    "sections": [
      {
        "title": "포모도로 타이머 사용법",
        "content": "포모도로 타이머를 사용하여 일정 시간 동안 집중하고, 짧은 휴식을 취하며, 일을 반복하세요. 집중 시간과 휴식 시간을 설정하고, 타이머를 시작하세요."
      },
      {
        "title": "포모도로 타이머의 중요성",
        "content": "포모도로 타이머는 집중력을 높이고 생산성을 높이는 데 도움을 줍니다. 집중 시간과 휴식 시간을 규칙적으로 반복하여, 일을 효율적으로 처리하세요."
      }
    ]
  },
  "timer": {
    "title": "온라인 타이머: 시간 관리를 위한 최고의 도구",
    "description": "온라인 타이머는 시간 관리를 위한 최고의 도구입니다. 시간을 측정하고, 일정 시간이 지나면 알림을 받을 수 있습니다. 사용하기 쉬운 인터페이스로, 시간 관리를 효율적으로 할 수 있습니다.",
    "url": "/ko/time/timer",
    "sections": [
      {
        "title": "온라인 타이머 사용법",
        "content": "온라인 타이머를 사용하여 시간을 측정하고, 일정 시간이 지나면 알림을 받을 수 있습니다. 시간을 설정하고, 타이머를 시작하세요."
      },
      {
        "title": "온라인 타이머의 중요성",
        "content": "온라인 타이머는 시간 관리를 위한 최고의 도구입니다. 시간을 효율적으로 관리하고, 일정 시간이 지나면 알림을 받아 업무를 처리하세요."
      }
    ]
  },
  "stopwatch": {
    "title": "스톱워치: 시간을 정확하게 측정하는 데 도움을 주는 도구",
    "description": "스톱워치는 시간을 정확하게 측정하는 데 도움을 주는 도구입니다. 시간을 측정하고, 일정 시간이 지나면 정지할 수 있습니다. 사용하기 쉬운 인터페이스로, 시간을 정확하게 측정할 수 있습니다.",
    "url": "/ko/time/stopwatch",
    "sections": [
      {
        "title": "스톱워치 사용법",
        "content": "스톱워치를 사용하여 시간을 정확하게 측정할 수 있습니다. 시간을 측정하고, 일정 시간이 지나면 정지하세요."
      },
      {
        "title": "스톱워치의 중요성",
        "content": "스톱워치는 시간을 정확하게 측정하는 데 도움을 줍니다. 시간을 정확하게 측정하여, 업무를 효율적으로 처리하세요."
      }
    ]
  },
  "countdown": {
    "title": "카운트다운 타이머: 중요한 이벤트까지 남은 시간을 정확하게 계산",
    "description": "카운트다운 타이머는 중요한 이벤트까지 남은 시간을 정확하게 계산하는 데 도움을 줍니다. 사용하기 쉬운 인터페이스로, 중요한 이벤트까지 남은 시간을 쉽게 확인할 수 있습니다.",
    "url": "/ko/time/countdown",
    "sections": [
      {
        "title": "카운트다운 타이머 사용법",
        "content": "카운트다운 타이머를 사용하여 중요한 이벤트까지 남은 시간을 정확하게 계산할 수 있습니다. 타겟 날짜를 입력하고, 카운트다운을 시작하세요."
      },
      {
        "title": "카운트다운 타이머의 중요성",
        "content": "카운트다운 타이머는 중요한 이벤트까지 남은 시간을 정확하게 계산하는 데 도움을 줍니다. 중요한 이벤트까지 남은 시간을 확인하고, 준비를 시작하세요."
      }
    ]
  },
  "lefttime": {
    "title": "남은 시간 계산기: 중요한 날짜까지 남은 시간을 정확하게 계산",
    "description": "남은 시간 계산기는 중요한 날짜까지 남은 시간을 정확하게 계산하는 데 도움을 줍니다. 사용하기 쉬운 인터페이스로, 중요한 날짜까지 남은 시간을 쉽게 확인할 수 있습니다.",
    "url": "/ko/time/lefttime",
    "sections": [
      {
        "title": "남은 시간 계산기 사용법",
        "content": "남은 시간 계산기를 사용하여 중요한 날짜까지 남은 시간을 정확하게 계산할 수 있습니다. 타겟 날짜를 입력하고, 남은 시간을 확인하세요."
      },
      {
        "title": "남은 시간 계산기의 중요성",
        "content": "남은 시간 계산기는 중요한 날짜까지 남은 시간을 정확하게 계산하는 데 도움을 줍니다. 중요한 날짜까지 남은 시간을 확인하고, 준비를 시작하세요."
      }
    ]
  }
}
